
// 一些数字的二进制表示是由形如 0.yyyyyyy... 的无穷串组成的, 其中y是一个k位的序列.
// 例如: 1/3的二进制表示是0.01010101...(y=01),
// 而 1/5的二进制表示是0.001100110011...(y=0011)
int main() {

// A. 设Y = B2U_k(y), 也就是说, 这个数具有二进制表示y. 给出一个由Y和k组成的公式表示这个无穷串的值.
// 提示: 考虑将二进制小数点右移k位的结果

// 设 x = 0.yyy...
// 将x左移k位, x << k = y.yyyyy
// 因为 B2U(y) = Y. 所以 x << k = y.yyyy... = Y + 0.yyyyy...
// 得到: Y + x = x << k => Y = x << k - x = x * (2^k - 1) => x = Y / (2^k - 1)
// 公式为: Y / (2^k - 1)

// B. 对于下面y的值, 串的数值为多少?
// (a). 101. => 5 / (2^3 - 1) => 5/7
// (b). 0110 => 6 / (2^4 - 1) => 6/15
// (c). 010011 => 19 / (2^6 - 1) => 19/63
}