

int main() {
  // 给定一个浮点数, 它具有k位指数n位小数, 对于下列数, 写出阶码E, 尾数M, 小数f和值V的公式. 另外, 请描述其位的表示.
  // A. 数7.0.

  // V = (-1)^s * M * 2^E

  // 由于 7 = 0b111, 7.0 = 1.11 * 2^2
  // 7.0 = 1.11 * 2^2
  // 所以 s = 0, M = 0b1.11, f = 0.11, E = 2
  // 因为: E = exp - bias,  bias = 2^(k-1) - 1
  // 所以: exp = E + bias = 2 + 2^(k - 1) - 1 = 2^(k-1) + 1
  // V 的二进制表示: 0b     0   10...01 110000
  //                   sign   k       n

  // B. 能够被描述的最大奇整数.
  // 考虑最大奇整数的整数二进制表示形式: 0b0 1...1
  // 那么对于浮点数来说, 即. 1.111...*2^E
  // 所以 s = 0, M = 1.1..1 (n个1), E = n = exp - bias => exp = n + bias
  // V 的二进制表示: 0b  0    n+bias 1...1
  //                   sign exp    n个1

  // C. 最小的正规格化数的倒数.
  // 最小的正规格化数的浮点数格式为: 0b 0     0...01 00000
  //                               符号位 exp    frac
  // 根据公式 V = (-1)^s * M * 2^E
  // M = 1.0000
  // V = 2^E = 2^(exp - bias)
  // 因为 exp = 1
  // 所以 E = 1 - bias
  // 即 V = 2 ^ (1 - bias)
  // 则倒数为:
  // V' = 1/(2 ^ (1 - bias)) = 2 ^ (bias - 1)
  // E' = bias - 1
  // exp' = E' + bias = 2 * bias - 1 = 2 * (2^(k-1) - 1) - 1 = 2^K - 3
  // 二进制模式为:
  // 注意: 无符号数 (2^k - 1)是的位模式为k个1, 所以 2^k - 3 为第2位的数为0
  // 0b     0 11...101 0...0
  //    符号位 exp      frac
}